---
type: ElementIsCurveDrivenFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementIsCurveDrivenFilter

`Autodesk.Revit.DB.ElementIsCurveDrivenFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementIsCurveDrivenFilter | — | `` |
| Constructor | ElementIsCurveDrivenFilter | 2011 | `public ElementIsCurveDrivenFilter ()` |
| Method | PassesFilter | — | `` |